# -*- mode:ruby -*-

###############################################################################
# setup hombrew core
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
brew "mas"

tap "parsoj/formulae" 

###############################################################################
# Apps

# Util Apps
mas "1Password", id: 1333542190
#cask "dropbox"
cask "expressvpn"

# Chat apps
cask "discord"
mas "Slack", id: 803453959

# productivity apps
mas "Fantastical 2", id: 975937182

cask "brave-browser"

###############################################################################
# Development tools

# cli dev tools
brew "coreutils" # replace OSX utils with GNU stuff
brew "git"
brew "ripgrep"
brew "trash"
brew "markdown"
brew "the_platinum_searcher"
brew "aspell"
brew "gnupg2"
brew "wget"
brew "fd"
brew "gnu-tar"
brew "sqlite"
#cask "mactex"
brew "gnutls"
brew "libressl"
brew "ruby"
brew "python" # several emacs packages require python packages to support them
brew "jq"

# external devtools
cask "docker"
brew "awscli"

################################################################################
# emacs compilation & support

#compilation
brew "automake"
brew "pkg-config"
brew "texinfo"
brew "libxml2"
brew "gnutls"
brew "gtk+3"

################################################################################
# Menu Bar stuff
cask "istat-menus"
cask "bitbar"


################################################################################
# Keybindings
brew "koekeishiya/formulae/skhd"

################################################################################
# Window Management
brew "koekeishiya/formulae/yabai"

